IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_mem_cfg_regs.xml
<module id="MEM_CFG_REGS" HW_revision="" description="MEM CFG Registers">
	<register id="DxLOCK" width="32" page="1" offset="0x0" internal="0" description="Dedicated RAM Config Lock Register">
		<bitfield id="LOCK_M0" description="M0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_M1" description="M1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_PIEVECT" description="PIEVECT RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="DxCOMMIT" width="32" page="1" offset="0x2" internal="0" description="Dedicated RAM Config Lock Commit Register">
		<bitfield id="COMMIT_M0" description="M0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_M1" description="M1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_PIEVECT" description="PIEVECT RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="DxACCPROT0" width="32" page="1" offset="0x8" internal="0" description="Dedicated RAM Config Register">
		<bitfield id="FETCHPROT_M0" description="Fetch Protection For M0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_M0" description="CPU WR Protection For M0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_M1" description="Fetch Protection For M1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_M1" description="CPU WR Protection For M1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="DxACCPROT1" width="32" page="1" offset="0xa" internal="0" description="Dedicated RAM Config Register">
		<bitfield id="CPUWRPROT_PIEVECT" description="CPU WR Protection For PIEVECT RAM" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxTEST" width="32" page="1" offset="0x10" internal="0" description="Dedicated RAM TEST Register">
		<bitfield id="TEST_M0" description="Selects the different modes for M0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_M1" description="Selects the different modes for M1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_PIEVECT" description="Selects the different modes for PIEVECT RAM" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="DxINIT" width="32" page="1" offset="0x12" internal="0" description="Dedicated RAM Init Register">
		<bitfield id="INIT_M0" description="RAM Initialization control for M0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_M1" description="RAM Initialization control for M1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_PIEVECT" description="RAM Initialization control for PIEVECT RAM." begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="DxINITDONE" width="32" page="1" offset="0x14" internal="0" description="Dedicated RAM InitDone Status Register">
		<bitfield id="INITDONE_M0" description="RAM Initialization status for M0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_M1" description="RAM Initialization status for M1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_PIEVECT" description="RAM Initialization status for PIEVECT RAM." begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="DxRAMTEST_LOCK" width="32" page="1" offset="0x16" internal="0" description="Lock register to Dx RAM TEST registers">
		<bitfield id="M0" description="DxTEST.TEST_M0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M1" description="DxTEST.TEST_M1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PIEVECT" description="DxTEST.TEST_PIEVECT LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing DxRAMTEST_LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LSxLOCK" width="32" page="1" offset="0x20" internal="0" description="Local Shared RAM Config Lock Register">
		<bitfield id="LOCK_LS0" description="LS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS1" description="LS1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxCOMMIT" width="32" page="1" offset="0x22" internal="0" description="Local Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_LS0" description="LS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS1" description="LS1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT0" width="32" page="1" offset="0x28" internal="0" description="Local Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_LS0" description="Fetch Protection For LS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS0" description="CPU WR Protection For LS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS1" description="Fetch Protection For LS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS1" description="CPU WR Protection For LS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxTEST" width="32" page="1" offset="0x30" internal="0" description="Local Shared RAM TEST Register">
		<bitfield id="TEST_LS0" description="Selects the different modes for LS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS1" description="Selects the different modes for LS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxINIT" width="32" page="1" offset="0x32" internal="0" description="Local Shared RAM Init Register">
		<bitfield id="INIT_LS0" description="RAM Initialization control for LS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS1" description="RAM Initialization control for LS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxINITDONE" width="32" page="1" offset="0x34" internal="0" description="Local Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_LS0" description="RAM Initialization status for LS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS1" description="RAM Initialization status for LS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="LSxRAMTEST_LOCK" width="32" page="1" offset="0x36" internal="0" description="Lock register to LSx RAM TEST registers">
		<bitfield id="LS0" description="LSxTEST.TEST_LS0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LS1" description="LSxTEST.TEST_LS1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_LOCK" width="32" page="1" offset="0xa0" internal="0" description="ROM Config Lock Register">
		<bitfield id="LOCK_BOOTROM" description="BOOTROM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_SECUREROM" description="SECUREROM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing ROM LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_TEST" width="32" page="1" offset="0xa2" internal="0" description="ROM  TEST Register">
		<bitfield id="TEST_BOOTROM" description="Selects the different modes for BOOTROM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_SECUREROM" description="Selects the different modes for SECUREROM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ROM_FORCE_ERROR" width="32" page="1" offset="0xa4" internal="0" description="ROM Force Error register">
		<bitfield id="FORCE_BOOTROM_ERROR" description="Force Bootrom Parity Error" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SECUREROM_ERROR" description="Force SECUREROM Parity Error" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
